https://youtu.be/PPeaRc-r1OI

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('titanic.csv')

In [4]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [5]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [6]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [7]:
target=df.Survived
inputs=df.drop('Survived',axis='columns')

In [10]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [12]:
inputs=pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [13]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [14]:
inputs.isna().sum()

Pclass      0
Age       177
Fare        0
female      0
male        0
dtype: int64

In [15]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [16]:
inputs.isna().sum()

Pclass    0
Age       0
Fare      0
female    0
male      0
dtype: int64

In [17]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [18]:
len(X_train)

712

In [19]:
len(X_test)

179

In [20]:
len(inputs)

891

In [21]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [22]:
model.fit(X_train,y_train)

GaussianNB()

In [23]:
model.score(X_test,y_test)

0.8156424581005587

In [24]:
X_test[:10]

     Pclass        Age     Fare  female  male
260       3  29.699118   7.7500       0     1
384       3  29.699118   7.8958       0     1
479       3   2.000000  12.2875       1     0
577       1  39.000000  55.9000       1     0
21        2  34.000000  13.0000       0     1
414       3  44.000000   7.9250       0     1
407       2   3.000000  18.7500       0     1
597       3  49.000000   0.0000       0     1
865       2  42.000000  13.0000       1     0
102       1  21.000000  77.2875       0     1

In [27]:
y_test[:5]

260    0
384    0
479    1
577    1
21     1
Name: Survived, dtype: int64

In [25]:
model.predict(X_test[:10])

array([0, 0, 1, 1, 0, 0, 0, 0, 1, 0], dtype=int64)

In [26]:
model.predict_proba(X_test[:10])

array([[0.98792469, 0.01207531],
       [0.98793448, 0.01206552],
       [0.03666419, 0.96333581],
       [0.00747904, 0.99252096],
       [0.97714129, 0.02285871],
       [0.9885336 , 0.0114664 ],
       [0.95195234, 0.04804766],
       [0.98728062, 0.01271938],
       [0.04117657, 0.95882343],
       [0.73374622, 0.26625378]])